       IDENTIFICATION DIVISION.
       PROGRAM-ID. OperationNegativeAndDecimalNumbers.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  NUM1 PIC S99V99.
       01  NUM2 PIC S99V99.
       01  RESULT_ADD PIC S99V99.
       01  RESULT_SUBTRACTION PIC S99V99.
       01  RESULT_MULTIPLY PIC S99V99.
       01  RESULT_DIVISION PIC S99V99.

       PROCEDURE DIVISION.
       NEGATIVE-POSITIVES-DECIMALS.
           MOVE -10.15 TO NUM1.
           MOVE -5.10 TO NUM2.
           COMPUTE RESULT_ADD = NUM1 + NUM2.
           COMPUTE RESULT_SUBTRACTION = NUM1 - NUM2.
           COMPUTE RESULT_MULTIPLY = NUM1 * NUM2.
           COMPUTE RESULT_DIVISION = NUM1 / NUM2.
           DISPLAY "ADD: " RESULT_ADD.
           DISPLAY "SUM: " RESULT_SUBTRACTION.
           DISPLAY "MULTIPLY: " RESULT_MULTIPLY.
           DISPLAY "DIVISION: " RESULT_DIVISION.
            STOP RUN.
       END PROGRAM OperationNegativeAndDecimalNumbers.