      IDENTIFICATION DIVISION.
      PROGRAM-ID. TheLevelNumbersOfExecution.

      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      DATA DIVISION.
      FILE SECTION.
      WORKING-STORAGE SECTION.
      01 User.
           01 Name PIC X(15) VALUE SPACES.
      PROCEDURE DIVISION.

      STOP RUN.

      END PROGRAM TheLevelNumbersOfExecution.