       IDENTIFICATION DIVISION.
       PROGRAM-ID. NegativeAndDecimalNumbers.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  NUM_DECIMAL PIC 99V99.
       01  NUM_POSITIVE PIC S9999.
       01  NUM_NEGATIVE PIC 9999.
       01  NUM_NEGATIVE_DECIMAL PIC S99V99.

       PROCEDURE DIVISION.
       NEGATIVE-POSITIVES-DECIMALS.
           MOVE 10.15 TO NUM_DECIMAL.
           DISPLAY "DECIMAL (POSITIVE): " NUM_DECIMAL.

           MOVE -1015 TO NUM_POSITIVE.
           DISPLAY "POSITIVE: " NUM_POSITIVE.

           MOVE -1015 TO NUM_NEGATIVE.
           DISPLAY "NEGATIVE: " NUM_NEGATIVE.

           MOVE -1015 TO NUM_NEGATIVE_DECIMAL.
           DISPLAY "NEGATIVE DECIMAL: " NUM_NEGATIVE_DECIMAL.

            STOP RUN.
       END PROGRAM NegativeAndDecimalNumbers.