      IDENTIFICATION DIVISION.
      PROGRAM-ID. TheLevelNumbersOfExecution.

      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      DATA DIVISION.
      FILE SECTION.
      WORKING-STORAGE SECTION.
      01 User.
           25 Name PIC X(15) VALUE SPACES.
           25 Lastnames PIC X(30) VALUE SPACES.
           25 Phone PIC X(9) VALUE SPACES.
      PROCEDURE DIVISION.

      STOP RUN.

      END PROGRAM TheLevelNumbersOfExecution.