       IDENTIFICATION DIVISION.
       PROGRAM-ID. LevelNumbersOfVariables.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  SINGLE-VARIABLE PIC 9 VALUE ZERO.

       01  COMPOSITE-VARIABLE.
           02 SUB-VARIABLE1 PIC X VALUE SPACE.
           02 SUB-VARIABLE2 PIC 9 VALU ZERO.

       01  COMPOSITE-VARIABLE2.
           05 SUB-VARIABLE1 PIC X VALUE SPACE.
           05 SUB-VARIABLE2 PIC 9 VALU ZERO.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            STOP RUN.
       END PROGRAM LevelNumbersOfVariables.