      *File logic.
       FD EMPLOYEES-FILE.
       01 EMPLOYEES-RECORD.
           05 EMPLOYEES-ID PIC 9(6).
           05 EMPLOYEES-NAME PIC X(25).
           05 EMPLOYEES-LASTNAMES PIC X(25).
           05 EMPLOYEES-AGE PIC 9(3).
           05 EMPLOYEES-PHONE PIC X(9).
           05 EMPLOYEES-ADDRESS PIC X(35).