       IDENTIFICATION DIVISION.
       PROGRAM-ID. Division.
       AUTHOR. Develop_easy
       INSTALLATION.
       DATE-WRITTEN.16/08/2023
       DATE-COMPILED.
       REMARKS.Program created for division of COBOL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello world"
           STOP RUN.
       END PROGRAM Division.