      IDENTIFICATION DIVISION.
      PROGRAM-ID. TheLevelNumbersOfExecution.

      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      DATA DIVISION.
      FILE SECTION.
      WORKING-STORAGE SECTION.
      01 Number1 PIC S99 VALUE -25.
      PROCEDURE DIVISION.

      STOP RUN.

      END PROGRAM TheLevelNumbersOfExecution.