       IDENTIFICATION DIVISION.
       PROGRAM-ID. DataDivision.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       linkage section.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           STOP RUN.
       END PROGRAM DataDivision.
       