      IDENTIFICATION DIVISION.
      PROGRAM-ID. IF-Of-RELATIONSHIP-OrComparison.

      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      DATA DIVISION.
      FILE SECTION.
      WORKING-STORAGE SECTION.

      PROCEDURE DIVISION.
      MAIN-PROCEDURE.
            DISPLAY "COBOL Course in Easy Programming."  
            STOP RUN.
      END PROGRAM IF-Of-RELATIONSHIP-OrComparison.